{"reviewerID": "AO94DHGC771SJ", "asin": "0528881469", "reviewerName": "amazdnu", "helpful": [0, 0], "reviewText": "We got this GPS for my husband who is an (OTR) over the road trucker.  Very Impressed with the shipping time, it arrived a few days earlier than expected...  within a week of use however it started freezing up... could of just been a glitch in that unit.  Worked great when it worked!  Will work great for the normal person as well but does have the \"trucker\" option. (the big truck routes - tells you when a scale is coming up ect...)  Love the bigger screen, the ease of use, the ease of putting addresses into memory.  Nothing really bad to say about the unit with the exception of it freezing which is probably one in a million and that's just my luck.  I contacted the seller and within minutes of my email I received a email back with instructions for an exchange! VERY impressed all the way around!", "overall": 5.0, "summary": "Gotta have GPS!", "unixReviewTime": 1370131200, "reviewTime": "06 2, 2013"}
{"reviewerID": "AMO214LNFCEI4", "asin": "0528881469", "reviewerName": "Amazon Customer", "helpful": [12, 15], "reviewText": "I'm a professional OTR truck driver, and I bought a TND 700 at a truck stop hoping to make my life easier.  Rand McNally, are you listening?First thing I did after charging it was connect it to my laptop and install the software and then attempt to update it.  The software detected a problem with my update and wanted my home address so I could be sent a patch on an SD card.  Hello?  I don't think I'm all that unusual; my home address is a PO box that a friend checks weekly and that I might get to check every six months or so.  I live in my truck and at truck stops.  If you need to make a patch available on an SD card then you should send the SD cards to the truck stops where the devices are sold.  I ran the update program multiple times until the program said that the TND 700 was completely updated.I programmed in the height (13'6\"), the length (53') and the weight (80,000#) of my rig and told it that I preferred highways.  I was parked at a truck stop in the Cincinnati OH area.  My next pickup was about 15 miles down the same freeway but on the other side of it a couple of blocks.  My cell phone GPS (Sprint) said to get on the freeway to get to my pickup.  The TND 700 routed me thru 23 miles of residential streets before finally getting me to my pickup.  Very exciting, especially since every time I refused to turn down a street posted \"No Trucks\" the TND 700 took almost 5 minutes to figure a re-route, and it happened multiple times on that short trip.I decided to give it another chance.  After my pickup on the north side of Cincinnati just off of I-75 I needed to head to Phoenix AZ via I-71.  Easy route is to just hop on I-75 and drive west and south to the intersection of I-71.  Indeed, that is what my cell phone advised.  The TND 700, however, wanted to route me over surface streets across the city and pick up I-75 on the other side of the city.  I turned it off and the next time I passed a truck stop of the same chain I purchased it at I returned it and got my money back.I then spent $30 on a cheap printer.  Now I take a minute to set up my route on Google and print it out.  Hasn't gotten me lost yet over several cross country trips.", "overall": 1.0, "summary": "Very Disappointed", "unixReviewTime": 1290643200, "reviewTime": "11 25, 2010"}
{"reviewerID": "A3N7T0DY83Y4IG", "asin": "0528881469", "reviewerName": "C. A. Freeman", "helpful": [43, 45], "reviewText": "Well, what can I say.  I've had this unit in my truck for about four days now.  Prior to that I had a Garmin 755T non-truck GPS.  One of my favorite features in that unit was the ability to plan a route by determining mileage using the stop or via feature.  What I would do is using a map I would route myself several different ways forcing the unit by putting in stops or vias at different locations along the route, otherwise, like most GPS 's, it determines what it thinks is the best route.  I could add up to 10 Via's or stop points for each route and then based on mileage and other factors determine which is the best route to take.  Multiple stops and the ability to route was the most important reason for having the Garmin.  However it was not truck specific.  And considering I am now hauling strictly hazmat I wanted something that would take that into consideration.  After perusing various forums, review sites, and word-of-mouth my choices boiled down to the Garmin 465T or the RAND McNally Intelliroute TND 700.  Even though it was quite a bit more than the Garmin I chose the TND 700 for several reasons.  The main one being the extra screen size, and its ability to coordinate with the RAND McNally truck atlas and also its ease of updating.Now on to my first impression of the TND 700.  It seems to be an aesthetically pleasing and durably built unit.  The first thing I noticed was it's very slow to boot compared to my old Garmin.  Whether this is unique to the TND 700 or is common amongst all truck specific gps units I cannot tell, but it's really not that big of a deal.  The second thing I noticed was the overwhelming wealth of information put forth.  That might explain why the manual (available via the TND dock) is well over 100 pages long.....  There is somewhat of a learning curve with this unit.  The next thing I noticed was the complexity of entering routes.  As previously mentioned I like to force it into my preferred routing by the use of stops or vias.  That was a big no go with this unit.  While you can enter multiple stops or vias it is nowhere near as user-friendly as my old Garmin.  Furthermore there is no way you can determine total mileage on the route that you have chosen, as I could with the Garmin.  Totally flummoxed by what appeared to be an omission of one of the best routing tools a trucker could have I went online and verified through an expert source connected with RAND McNally that no, that feature was a couple updates down the line and was not available at this point.  Unbelievable.  Also forcing the unit to follow a specific route can be very challenging.  For a unit of this price, and feature laden, I find this totally unacceptable.  I am still mulling over selling this unit  and buying the Garmin 465T.  I really do like this GPS, the screen is magnificent, and the volume is awesome.Another thing I've noticed, which I do not think is unique to this unit, is some of the weird routing that it does.  I've never owned a truck specific GPS before but after playing with this one for a couple of days I get the impression that what RAND MacNally (and the others that use Navteq) has done is take a plain old car specific Navteq map and a road atlas with truck restrictions and made notifications on the map.  In most databases there is not a 100% thorough listing of every road in the country.  What I mean is that this unit will route you down roads you don't belong on.  Today while coming home it tried routing me on several  9 ton County roads.  What that means is that a truck is limited to 73280 unless the road is posted at 10 tons.  County roads do not have that restriction listed in the RAND McNally road atlas, so I believe that is why it is not listed.....  Also unacceptable in a unit of this price and sold as truck specific.  However I'd be willing to bet the other truck specific units are the same way as no one has ever done a truck specific version of NavTeq.Another bone I have to pick is the POI's. Not only the truck specific ones but the others all seem to be somewhat outdated.  I think the Garmin, at least the ones that I have used, are more current.  It would also be nice if I could add my own POI'sTo sum it up I will keep this unit a little longer to see if I can make it workable.  If not I will go back to Garmin.  I like the concept and I like the unit but at this point I'll have to say I am somewhat unimpressed.pros:Large screenterrific imagesoutstanding volumecons:inability to determine route mileage by multiple stops and viasa somewhat outdated POI information.Non-truck specific routings.Cost.", "overall": 3.0, "summary": "1st impression", "unixReviewTime": 1283990400, "reviewTime": "09 9, 2010"}
{"reviewerID": "A1H8PY3QHMQQA0", "asin": "0528881469", "reviewerName": "Dave M. Shaw \"mack dave\"", "helpful": [9, 10], "reviewText": "Not going to write a long review, even thought this unit deserves one. I've driven well over 1-mil miles and done most of my own routing so I pretty know whats the fastest and shortest. Have been using a basic garmin for the past three years and with ANY Gps unit they'll ALL get you in trouble if you let them. I was really excited about this unit, due to the size and the features. Allot of great grafics and on screen info thats usefull. But the most basic item that it was lacking was the gps tracking. I gave this unit allot of leadway on its mistakes due to the fact that it had allot of cool stuff that it did, but its ability to track you and route you was not even close to what the basic garmin could due. Its like the prossesor that they installed in the TND 700 was 10 years old. Example if I needed to make a simple route change I.E. in town down to the next street due to the fact that I couldn't make the turn or the street was blocked off, it would take the TND 700 upwards of 45 seconds to a minute and a half to reroute me. Here I'm sitting at a stop light waiting for directions and waiting that long with cars on my backside didn't make me happy. This is a problem that happened evertime you had to reroute, weather it was a simple street change or a major highway change. Also from the time you turned the unit on it would take twice as long to boot itself up. At least a dozen times with in a week it put me on the wrong roads and when I made a wrong turn it got it self lost....I.E. take left on xyz street, and it was some ones drive way. Or turn left in 800 yards and the turn was less than 10 feet away. You might think in a conjested city situation I might get a little mixed up, but this is out in the country. Twice it put me under 12'6\" bridges when I'm 13'6\". Of course I made sure all my truck setting where they were supposed to be. I also updated the OS version,via Rand McNally. All in all I expected alot out of this unit and got a unit that should of been field tested with some people that drive allot. It just had to many route mistakes. Going back to the basic garmin. This isn't just my complaints, I have three friends that bought the same unit and have the same complaints. All of us returned the units.", "overall": 2.0, "summary": "Great grafics, POOR GPS", "unixReviewTime": 1290556800, "reviewTime": "11 24, 2010"}
{"reviewerID": "A24EV6RXELQZ63", "asin": "0528881469", "reviewerName": "Wayne Smith", "helpful": [0, 0], "reviewText": "I've had mine for a year and here's what we got. It tries to route be down non truck routes while telling me the truck route is illegal for me. This is such a bad problem that even Interstate 25 in Denver Colorado is listed (according to this GPS) as a non- truck route and will route you through the city instead. There are several drivers within our company who own one and more than half (of about 50) have crashed to an un-recoverable state. Our company representative said that Rand McNally informed them that the GPS was not designed to say on for a long period of time. Really? it's a truck driver GPS. We have one driver with a $2400 dollar ticket due to this GPS routing him down the wrong road. The companies response was to update the unit. I've had mine for a year, I never noticed one update that corrected functionality, they only seem to keep messing the tools. I want a GPS that routes, if I wanted tools I'd buy software for my computer.My suggestion is to by a nice Garmen. My one rated for cars actually routes me better than this one rated for trucks.Wayne", "overall": 1.0, "summary": "Major issues, only excuses for support", "unixReviewTime": 1317254400, "reviewTime": "09 29, 2011"}
{"reviewerID": "A2JXAZZI9PHK9Z", "asin": "0594451647", "reviewerName": "Billy G. Noland \"Bill Noland\"", "helpful": [3, 3], "reviewText": "I am using this with a Nook HD+. It works as described. The HD picture on my Samsung 52&#34; TV is excellent.", "overall": 5.0, "summary": "HDMI Nook adapter cable", "unixReviewTime": 1388707200, "reviewTime": "01 3, 2014"}
{"reviewerID": "A2P5U7BDKKT7FW", "asin": "0594451647", "reviewerName": "Christian", "helpful": [0, 0], "reviewText": "The cable is very wobbly and sometimes disconnects itself.The price is completely unfair and only works with the Nook HD and HD+", "overall": 2.0, "summary": "Cheap proprietary scam", "unixReviewTime": 1398556800, "reviewTime": "04 27, 2014"}
{"reviewerID": "AAZ084UMH8VZ2", "asin": "0594451647", "reviewerName": "D. L. Brown \"A Knower Of Good Things\"", "helpful": [0, 0], "reviewText": "This adaptor is real easy to setup and use right out of the box. I had not problem with it at all, it is well worth the purchase. I recommend this adaptor very much for viewing your Nook videos on your HDTV. I just disagree with other reviews on the length of the adaptor, I found it to be fairly adequate as to how and where it is connected to my TV. For me it was just right not too long or too short, I was able to place my Nook right below the connection on the TV stand, it did not fall or anything else, it is fine. Use your own judgement, I'm too busy watching my movies :)", "overall": 5.0, "summary": "A Perfdect Nook HD+ hook up", "unixReviewTime": 1399161600, "reviewTime": "05 4, 2014"}
{"reviewerID": "AEZ3CR6BKIROJ", "asin": "0594451647", "reviewerName": "Mark Dietter", "helpful": [0, 0], "reviewText": "This adapter easily connects my Nook HD 7&#34; to my HDTV through the HDMI cable.  This is good for traveling because it makes any hotel TV a potential smart TV so long as there is an accessible HDMI port.  It is also good for sharing photos from FB on a bigger screen. A bit pricey, but a good accessory to have.  Be sure to note that this is ONLY for the Nook HD and HD+ series.  It will not work with a standard Nook.", "overall": 4.0, "summary": "A nice easy to use accessory.", "unixReviewTime": 1405036800, "reviewTime": "07 11, 2014"}
{"reviewerID": "A3BY5KCNQZXV5U", "asin": "0594451647", "reviewerName": "Matenai", "helpful": [3, 3], "reviewText": "This product really works great but I found the following items you need to keep in mind:- You must have your power adapter connected for it to work...it plugs in the the bottom. It appears it needs power from the nook power adapter to operate.- The plug fits in loosely and you cannot move the Nook around much without holding the adapter in place.- On initial plugin it seems you need to rock it around to get the connection but then it seems solid.- It works with a 25ft high quality HDMI cable so you can put the NOOK across the room with you. Not tested with cheap cables.Warning...I found that my LG SmartTV 3D from a few years back does not work with this adapter but it does not seem to work with many things...bad software. This adapter works fine with other HDMI devices I have used like monitors and I am sure other TVs.Gave it five stars because it really is nice to extend the screen and use your Nook as a streaming server to your TV. Nice they made such a device.", "overall": 5.0, "summary": "This works great but read the details...", "unixReviewTime": 1390176000, "reviewTime": "01 20, 2014"}
{"reviewerID": "A7S2B0I67WNWB", "asin": "0594481813", "reviewerName": "AllyMG", "helpful": [2, 2], "reviewText": "This item is just as was described in the original description, works without any issues to be seen. Good product", "overall": 4.0, "summary": "As expected", "unixReviewTime": 1397606400, "reviewTime": "04 16, 2014"}
{"reviewerID": "A3HICVLF4PFFMN", "asin": "0594481813", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "bought for a spare for my 9&#34; Nook HD and it fit perfectly.  Very satisfied with the price much less than on the BN site", "overall": 5.0, "summary": "great fit", "unixReviewTime": 1399248000, "reviewTime": "05 5, 2014"}
{"reviewerID": "ANSKSPEEAKY7S", "asin": "0594481813", "reviewerName": "Gena", "helpful": [1, 1], "reviewText": "My son crewed my HD charger cord so I needed another one, this is exactly like the one my son destroyed.", "overall": 5.0, "summary": "Works Great", "unixReviewTime": 1372032000, "reviewTime": "06 24, 2013"}
{"reviewerID": "A2QBZA4S1ROX9Q", "asin": "0594481813", "reviewerName": "Jake", "helpful": [0, 1], "reviewText": "This is a good beefy 2 amp charger, but it covers two outlets on a power strip. It's ok in a regular wall outlet. The best thing is it uses a standard USB connector so it can charge more than just a Nook (I have a Kindle Fire HD+).", "overall": 3.0, "summary": "It Works", "unixReviewTime": 1369440000, "reviewTime": "05 25, 2013"}
{"reviewerID": "ANY6JUFM0GH8U", "asin": "0594481813", "reviewerName": "J. Clement", "helpful": [2, 2], "reviewText": "I lost my B&N original cable.  I looked around for an new one.  I tried  a different, cheaper model but it didn't fit my device properly so back to the drawing board.  I ordered this one.  I am satisfied.  It works exactly as expected and fits perfectly.  I would recommend this product to anyone looking for a spare or in lieu of the original usb cable adapter.", "overall": 5.0, "summary": "Great replacement for original power cable", "unixReviewTime": 1394323200, "reviewTime": "03 9, 2014"}
{"reviewerID": "AT09WGFUM934H", "asin": "0594481813", "reviewerName": "John", "helpful": [0, 0], "reviewText": "It does 2A and charges a DEAD Nook in a few hours. It does so with a LOT of heat, compared to most wall worts. I have a dual charger where 1 port is 2.1A and the other is 1A for total output of 3.1A that doesn't run as hot as this. And i use that to power a raspberry pi to avoid needing a powered hubIt does the job adequately as it's designed to. Just hot. I would always unplug it if not using (even though it cools off) because of the amount of heat made. The nook hd+ runs hot too right where you hold it on the left side in portrait, but not so much when charging. I guess it's better to have it at the plug.", "overall": 3.0, "summary": "This is the oem charger you get with the nook hd+", "unixReviewTime": 1377907200, "reviewTime": "08 31, 2013"}
{"reviewerID": "AGAKHE014LQFU", "asin": "0594481813", "reviewerName": "Nicodimus", "helpful": [3, 5], "reviewText": "Go to Target or Barnes and Noble instead, and pay $25 (which is still a huge markup, considering they make the thing for 50 cents.) This is the worst option if you need one of these. It's price gouging, pure and simple.", "overall": 3.0, "summary": "$45 for a power cord? Good luck with that.", "unixReviewTime": 1379462400, "reviewTime": "09 18, 2013"}
{"reviewerID": "A1S6B5QFWGVL5U", "asin": "0594481813", "reviewerName": "T. Vaughan", "helpful": [2, 2], "reviewText": "Works well, a little pricey I think for a charging cable, but then again, not losing the original would be a lot cheaper than any replacement", "overall": 4.0, "summary": "Good replacement", "unixReviewTime": 1372291200, "reviewTime": "06 27, 2013"}
{"reviewerID": "A20XXTXWF2TCPY", "asin": "0972683275", "helpful": [0, 0], "reviewText": "This is a great buy, compared to a $60 or more a retail store.", "overall": 5.0, "summary": "Excelant mount for Tv. Would buy more if I needed them.", "unixReviewTime": 1405123200, "reviewTime": "07 12, 2014"}
{"reviewerID": "A2IDCSC6NVONIZ", "asin": "0972683275", "reviewerName": "2Cents!", "helpful": [1, 1], "reviewText": "This mount is just what I needed.  It is strong and sturdy.  It folds almost flat to enable the television to sit square and flat against the wall if desired and extends and rotates for angle turns.  A perfect fit as long as you match the correct visa pattern for your television.", "overall": 5.0, "summary": "Perfect", "unixReviewTime": 1367280000, "reviewTime": "04 30, 2013"}
{"reviewerID": "A1EDI0X3GI1SK7", "asin": "0972683275", "reviewerName": "AGW", "helpful": [0, 1], "reviewText": "Great deal, easy to mount and it appears to be fairly sturdy. I mounted a 32 in tv on it and it works great.", "overall": 5.0, "summary": "32 In TV Mount", "unixReviewTime": 1323993600, "reviewTime": "12 16, 2011"}
{"reviewerID": "A3BMUBUC1N77U8", "asin": "0972683275", "reviewerName": "ahoffoss", "helpful": [0, 0], "reviewText": "This mount works really well once you get it up and going.  Only problem is just the arms are a little goofy getting them all in the right spot.  But that's really not too big an issue considering all the different TV's and their mounting hole locations.", "overall": 4.0, "summary": "Pretty simple, but definitely good!", "unixReviewTime": 1385164800, "reviewTime": "11 23, 2013"}
{"reviewerID": "AVRFGGCCCR6QU", "asin": "0972683275", "reviewerName": "Alberto Dieguez \"premiere purchaser of random...", "helpful": [3, 4], "reviewText": "This wall mount does everything it's supposed to do.  The piece that attaches to the wall isn't overly long, which made it easier to mount the arm in the tight space I needed to mount it in.  The only issues I saw was that the joints were VERY tight initially and as we moved the arm around to install it, the joints loosened up to the point where I had to take the included allen wrench and tighten them up again.", "overall": 4.0, "summary": "Fairly good wall mount", "unixReviewTime": 1283126400, "reviewTime": "08 30, 2010"}
{"reviewerID": "A3UOSOCRKS3WIH", "asin": "0972683275", "reviewerName": "Allen Coberly", "helpful": [0, 0], "reviewText": "for the price you just cant beat this item. I bought it for a house I was selling so I could hang some tv and it worked great. Good quality for the price.", "overall": 5.0, "summary": "Cant Beat it!", "unixReviewTime": 1368316800, "reviewTime": "05 12, 2013"}
{"reviewerID": "A371ZZ95ZQEIZV", "asin": "0972683275", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "I received the mount, which was well packaged for shipping.  The installation instructions were Moderately clear.  No issues following them, they were just a little disjointed depending on the wall surface you were installing on.My shipment had a mis-cut piece, and was missing 4 screws.  I contacted the Manufacturer, and they shipped me a replacement part and screws the very next day (Shipped out of Texas, so normal mailing times applied)I like how the Mount fits together, and I easily mounted my 60lbs TV by myself.  The part that attaches to the TV has a hook that will hold the TV on the Arm till you bolt it on.It's very adjustable, and pushes almost flush with the wall.I'm very happy, but took one star for the miscut piece.", "overall": 4.0, "summary": "Sturdy Mount, good customer service", "unixReviewTime": 1389052800, "reviewTime": "01 7, 2014"}
{"reviewerID": "A7060R14RJF3I", "asin": "0972683275", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "Took a bit of work, but used this to fit an older vizio 32&#34; monitor to the wall to use as a compute monitor. Stable and like the ability to move the tv to different angles. The vizio was older and did not have the standard holes, this product fit and holds the tv very stable.", "overall": 4.0, "summary": "Works", "unixReviewTime": 1368835200, "reviewTime": "05 18, 2013"}
{"reviewerID": "A26QCCO0101CO1", "asin": "0972683275", "reviewerName": "Amazon Customer \"jkhinch\"", "helpful": [7, 9], "reviewText": "I used this for my 47&#34; Samsung. Its fit/feel is great. Easy installation. Appears strong; although I personally spent way too much on the tv to risk leaving it fully outstretched with too little lag bolts for a long time! It is very convenient to be able to move it away from the wall however and I would feel very comfortable tilt or swiveling if needed. The movement is fluid and easily adjustable.I am very pleased with my purchase.", "overall": 5.0, "summary": "Just what I'd hoped", "unixReviewTime": 1361404800, "reviewTime": "02 21, 2013"}
{"reviewerID": "APBF796U7GUTV", "asin": "0972683275", "reviewerName": "Amazon Customer \"steve-mc2\"", "helpful": [1, 1], "reviewText": "This item serves its purpose as well as any other mount.  Its most appealing attribute is its large range of motion.  I am using this to corner-mount a 32\" TV and it works perfectly to hide the mount, receptacles, and cables behind the TV.  Very easy installation as well.", "overall": 5.0, "summary": "Nice Mount", "unixReviewTime": 1331942400, "reviewTime": "03 17, 2012"}
{"reviewerID": "A2HLNXOYLMERTC", "asin": "0972683275", "reviewerName": "anthony smith", "helpful": [0, 0], "reviewText": "I love this mount.  This is the 4th one I've bought and it works great every time.  excellent seller and excellent product", "overall": 5.0, "summary": "Buy this mount its the best", "unixReviewTime": 1397606400, "reviewTime": "04 16, 2014"}
{"reviewerID": "A3CCITVF0WL6KE", "asin": "0972683275", "reviewerName": "A. Ramos", "helpful": [0, 0], "reviewText": "I am very glad for buying it.  It is heavy duty and good quality for the price.  It was very easy to install.", "overall": 5.0, "summary": "VideoSecu Swing Arm TV Wall Mount", "unixReviewTime": 1357689600, "reviewTime": "01 9, 2013"}
{"reviewerID": "AYQNWE3AX4H08", "asin": "0972683275", "reviewerName": "arl6969 \"arl6969\"", "helpful": [0, 0], "reviewText": "this holds up my 55inch sony with ease. make sure u mount this with ur own lag screws into the heart of the 2x4 ur mounting to and u won't have any problem--u may have to make a modificatoin or two but use ur brain and figure it out-- it'll be there till the house falls!!!3inch lag screws is the way to go don't be cheap go buy em.---how much did u pay for the tv????", "overall": 5.0, "summary": "work great", "unixReviewTime": 1374105600, "reviewTime": "07 18, 2013"}
{"reviewerID": "A3P24ZSF9IQRJJ", "asin": "0972683275", "reviewerName": "average customer", "helpful": [0, 0], "reviewText": "Nice quality still works great... very happy with this purchase... need to add 10 more words.. so what can I say its a wall mount that I haven't had any problems with", "overall": 5.0, "summary": "great", "unixReviewTime": 1402617600, "reviewTime": "06 13, 2014"}
{"reviewerID": "A1JI3XL5ME8CWM", "asin": "0972683275", "reviewerName": "Beakeagles", "helpful": [0, 0], "reviewText": "Great bracket for small TVs.  I used it on a 19\" LCD and it worked well.  The large mounting plate may block some connections on some TVs.  Installed easily and could be adjusted to make level.  The links were very tight and need to be loosened for initial installation.  When the TV is in the desired position, you can tighten them up.", "overall": 4.0, "summary": "Great product for money", "unixReviewTime": 1336435200, "reviewTime": "05 8, 2012"}
{"reviewerID": "AQBLWW13U66XD", "asin": "0972683275", "reviewerName": "Benjamin Belanger \"v dbl u\"", "helpful": [0, 0], "reviewText": "I bought this for a 22\" TV for my son. I mounted this onto the corner stud and it works great! I love the angles it can achieve. Fees Very sturdy and well built. It works perfect for my application. Very happy with this purchase!", "overall": 5.0, "summary": "High Quality/Low Price", "unixReviewTime": 1375574400, "reviewTime": "08 4, 2013"}
{"reviewerID": "AUKEU9CW56TT4", "asin": "0972683275", "reviewerName": "B. Kilpatrick", "helpful": [0, 0], "reviewText": "I am using this mount for a 39 inch Vizio TV and it has been great. The installation process was quick and easy and we LOVE the variety of angles that you can get from this mount. We have it on a side wall in our bedroom and we can pull the tv out and move it completely perpendicular to the wall on which it is mounted if we want to. (We don't usually move it quite perpendicular, but it works to do this.)My only complaint is that the joints are a little on the stiff side. It takes quite a bit of force to move the TV from one position to another. It's a little hard for my wife to do-- especially with the TV mounted about 6ft up on the wall. It may be possible to loosen these pivot points, but I have not tried. I'm a little nervous about making it less stable if I do.Overall, it's a great mount. Highly recommended.", "overall": 5.0, "summary": "Easy to Mount; Rock-solid", "unixReviewTime": 1396828800, "reviewTime": "04 7, 2014"}
{"reviewerID": "A23A7OH3AM0PDA", "asin": "0972683275", "reviewerName": "B. Onat", "helpful": [0, 0], "reviewText": "I installed this for my sister who had a 22\" Philips LCD. Nice sturdy mount, with all of the nuts, bolts, screws included. Only problem was that since my tv was so small, and I was using the most inner mounting hols on the mount, the outside edges of the mount covered both the cable connection, and the power cable connection. Instead of returning, (then paying $70 from a local store) I simply went to a hardware store, got a 1 & 1/2 inch boring tool that attaches to a hand drill, and drilled holes into the mount. It was pretty easy, but a bit messy. It is not visible after mounting the TV, so who cares?? It is one thing to consider before buying this, there may be another mount that does not cover your TV connections. Otherwise swivels well, does not sag, good value.", "overall": 4.0, "summary": "Nice Mount, beware of cable connections", "unixReviewTime": 1296086400, "reviewTime": "01 27, 2011"}
{"reviewerID": "A12AU3CNAWYO5D", "asin": "0972683275", "reviewerName": "bonbon", "helpful": [0, 0], "reviewText": "Didn't think it would work as well as it has,because the metal was a lighter guage thanwe expected, but it hardly deflected from theweight of the TV, even extended straight out.", "overall": 5.0, "summary": "Works like a charm so far", "unixReviewTime": 1356220800, "reviewTime": "12 23, 2012"}
{"reviewerID": "A5O0P0JV6PLU3", "asin": "0972683275", "reviewerName": "bone", "helpful": [0, 0], "reviewText": "very heavy duty construction, extends, tilts perfectlya steal at this pricewill be happy to buy another 1 or 2 if needed", "overall": 5.0, "summary": "deal!", "unixReviewTime": 1353801600, "reviewTime": "11 25, 2012"}
{"reviewerID": "A27X48PMUGK6U4", "asin": "0972683275", "reviewerName": "Boyd", "helpful": [0, 0], "reviewText": "Well constructed wall mount for TV sets up to 37 inches. The mounting  plate has numerous holes for varius sets. Plenty of extra hardware provided. Price was about 1/8th of what it would cost on the open market. I recommend it highly.", "overall": 5.0, "summary": "HD TV wall mount", "unixReviewTime": 1290211200, "reviewTime": "11 20, 2010"}
{"reviewerID": "A2KQDWZZUBBNOJ", "asin": "0972683275", "reviewerName": "Bradley Pool", "helpful": [0, 0], "reviewText": "I used it to mount a 32\" LCD TV to the wall... about 28LBS.  I installed it in less than 1/2 hour and am very happy with the results.PROS:-Comes with all of the hardware you'll need-Comes with some extra hardware of which I have NO IDEA what it is there for.  I suspect it's a 'universal' hardware pack for several models and not all hardware is used for all models, but it's nice to have a little 'extra' (which is always better than not enough!)-The included Level is nice... well it's cheap but it works!-The instructions did a decent enough job of explaining how to install the unit.CONS:-Metal is just a tad on the flimsy side.  I have no problems trusting it with my &lt;30lb television but if I were to mount something closer to its maximum rated weight of 55lbs, I think I would be quite a bit nervous about it holding up.-The holes in the base were just a little bit too wide for my wall stud.  I think the particular stud I was installing it onto was a typical 2X4 and if centered, the left and right side holes were just a little too far to grab both sides of the stud.  I had to reposition it so that the center holes were aligned to the left side of the stud, and that the right side holes were aligned to the right side of the stud.  As a result, I was only able to install four of the six bolts to hold it in place, but I don't feel it will be an issue with my 28LB television.  If your house uses wider studs this probably wouldn't even be an issue.-The metal does sag just a little bit with the weight of the television on it.  I mounted the base just a little bit \"off level\" to help compensate for this, and had no problems getting the television level using the adjustments available to me.CONCLUSION:  All in all It's not a bad unit.. ESPECIALLY for the price.  Yes I would have liked to see a sturdier unit, but when you take into account the &lt;$30 price tag, it's an excellent bargain.  I don't think I'll have any issue with a static mounting of my TV in the corner of the bedroom *BUT* if you are considering installing this unit for a television that will see a lot of traffic, constant repositioning, etc... then you might want to spend more money on something sturdier.", "overall": 4.0, "summary": "It works!", "unixReviewTime": 1306800000, "reviewTime": "05 31, 2011"}
{"reviewerID": "A27XULAA9X5ZGQ", "asin": "0972683275", "reviewerName": "Branon Young", "helpful": [0, 0], "reviewText": "This mount is excellent. It is very well built and sturdy. I used it to mount a 32\" TV and it fit the need perfectly. The price was also very good and much, much cheaper than what an inferior mount would cost in a retail store. I would definitely recommend.", "overall": 5.0, "summary": "Very Pleased", "unixReviewTime": 1329436800, "reviewTime": "02 17, 2012"}
{"reviewerID": "A3IIGCFLKVFW8M", "asin": "0972683275", "reviewerName": "Brian M. Kaplan \"Brian M. Kaplan\"", "helpful": [0, 0], "reviewText": "Works great and is so much cheaper than the more expensive versions at the Big box stores. It is super easy to install yourself too. You just need a drill and a ratchet set to get it into the stud (oh yea a stud finder too).", "overall": 5.0, "summary": "Holds a lot", "unixReviewTime": 1393459200, "reviewTime": "02 27, 2014"}
{"reviewerID": "A20VSTDILG9K7H", "asin": "0972683275", "reviewerName": "Busy Momma", "helpful": [0, 0], "reviewText": "We bought this for the tv in our gym as it gets moved around a bit.  It's definitely sturdy and works well.  Our tv in there is 24&#34;,", "overall": 4.0, "summary": "Works well", "unixReviewTime": 1402617600, "reviewTime": "06 13, 2014"}
{"reviewerID": "A3VKO21KYDJQ2W", "asin": "0972683275", "reviewerName": "C. Aaland", "helpful": [0, 0], "reviewText": "For the price, you can't beat it. Mine didn't come with any of the screws for the TV, but luckily I had some leftover from another mount so I didn't want to bother returning it. Also, not sure what they mean by tilt, but mine doesn't. The arm extends in and out as said, tv swivels left to right, but does not tilt up and down as was my expectation. Otherwise, can't beat it for the price as in Target/Best Buy etc., these are going for $60+.", "overall": 3.0, "summary": "Great for the price.", "unixReviewTime": 1310428800, "reviewTime": "07 12, 2011"}
{"reviewerID": "A1MSO6LERG39PC", "asin": "0972683275", "reviewerName": "cajunjake", "helpful": [1, 1], "reviewText": "Cannot beat this deal anywhere else on the web!  All other retailers are over-priced for what you are getting - a couple pieces of fabricated metal to hold a TV that articulates! This mount is reasonably priced.Pros:  Easy to install (helps to have a cordless driver to drill 6 pilot holes, and to drive in 6 lag screws. You also need to have a stud finder).- Well fabricated- Mount does everything advertised (i.e. articulates - you made need to loosen up some nuts)Con's: Really stretching here since this is a good deal: Instructions could use some help for the \"novice\" DIY'ersInstall tip:  It really helps if you have a second person assisting you for the final step of mounting the flat panel to the TV mountInstalled a 15.5 lbs, 26 Inch Flat Panel LCD (VESA 200mm X 100mm) to this mount. Mount works beautifully! I originally had the TV sitting a little high on a stand, but then the picture was not as good because of the upward viewing angle of the screen (inherent problem with cheaper LCD's - not being directly in front of a LCD screen) - this mount corrected this issue by allowing me to \"tilt down\" the screen.  I would strongly recommend this mount if you are in the market.", "overall": 5.0, "summary": "Outstanding Articulating Wall Mount!", "unixReviewTime": 1347494400, "reviewTime": "09 13, 2012"}
{"reviewerID": "A20Q4FIBCAG2ZV", "asin": "0972683275", "reviewerName": "cameron", "helpful": [0, 0], "reviewText": "This mount is easy to install and very sturdy and is very functional and very affordable for the price. A+", "overall": 5.0, "summary": "great product", "unixReviewTime": 1366848000, "reviewTime": "04 25, 2013"}
{"reviewerID": "A1980MGZXSGJP", "asin": "0972683275", "reviewerName": "Captain \"Captain America\"", "helpful": [0, 0], "reviewText": "Works like a charm! Lies flat on the wall when I want it too and pulls out and swivels like a charm when I need it too!The instructions call for it to be mounted into a stud in the wall, however mine is mounted directly into the drywall using heavy duty anchors and it works perfect as well! This is a great product for an amazing price!", "overall": 5.0, "summary": "Great product for a great price!", "unixReviewTime": 1361059200, "reviewTime": "02 17, 2013"}
{"reviewerID": "A1GLL5CJ1SFAMS", "asin": "0972683275", "reviewerName": "Carolyn D \"Carolyn D\"", "helpful": [0, 0], "reviewText": "Easey to put together and install. Used to mount a 37\" LED flat screen. Instuction say to mount the complete unit but if you mount the TV to the back plate on the ground first its a one person job. Well built product for being made in China.wish you could buy American made, better luck next time.", "overall": 5.0, "summary": "wall mount", "unixReviewTime": 1326326400, "reviewTime": "01 12, 2012"}
{"reviewerID": "A2683OJ85CLWFA", "asin": "0972683275", "reviewerName": "Castle", "helpful": [0, 0], "reviewText": "I hung this in my house with great ease and it held up my 8 year old son because I wasn't going to put the 55&#34; flat screen on it to find out that it failed. Fully extends out 2 feet. This was worth the money.", "overall": 5.0, "summary": "Booyah!", "unixReviewTime": 1360454400, "reviewTime": "02 10, 2013"}
{"reviewerID": "A3M6S7Y1FNPOLD", "asin": "0972683275", "reviewerName": "Charlie Troutman \"Charlie\"", "helpful": [0, 0], "reviewText": "Wanted the monitor off of the desk, so we mounted on the wall.  I would have rather had a vertical adjustment as well, but for the price, this unit does the job.", "overall": 3.0, "summary": "for 25&#34; monitor, it worked well", "unixReviewTime": 1355097600, "reviewTime": "12 10, 2012"}
{"reviewerID": "AOU1TM9UA1BZF", "asin": "0972683275", "reviewerName": "chicago mom", "helpful": [0, 0], "reviewText": "very secure, we did have to use concrete bolts thought since we were putting it on an outside wall made of lath and plaster with concrete brick on the outside.  One of the best features is there is one piece that attaches to the tv and another that attaches to the wall.  the piece on the tv actually hooks onto the piece on the wall.  I am really happy with this purchase.", "overall": 5.0, "summary": "awesome", "unixReviewTime": 1388620800, "reviewTime": "01 2, 2014"}
{"reviewerID": "A3S5643F4JNLQQ", "asin": "0972683275", "reviewerName": "chitownrun", "helpful": [0, 1], "reviewText": "I live in a studio condo and I needed something to rotate to see from my bed and my couch on the other side of the main room. Once you figure out which instructions to use (several varieties are included to accommodate different scenarios and tvs), they are pretty thorough. Don't be afraid to tighten specific &#34;joints&#34; and loosen others to get it how you want it.Originally had bought a different one, and be careful of this, but it didn't didn't have near the amount of swing as this one does.", "overall": 5.0, "summary": "Just what I was needing.", "unixReviewTime": 1373587200, "reviewTime": "07 12, 2013"}
{"reviewerID": "AJIA55AVU0CUS", "asin": "0972683275", "reviewerName": "Chris C \"Chris C\"", "helpful": [0, 0], "reviewText": "Holds the TV fine and the articulation is great.  We use it in a downstairs bedroom where we can move it to be seen from the bed or the treadmill.  Has cable mgmt as well.", "overall": 4.0, "summary": "For 22\" LCD", "unixReviewTime": 1364947200, "reviewTime": "04 3, 2013"}
{"reviewerID": "A3C51ESBUD8QAJ", "asin": "0972683275", "reviewerName": "chuckn", "helpful": [0, 0], "reviewText": "Another great buy from Amazon. The local stores wanted twice the money and the other mounts were cheaply made. this mount is made well and you get a free hdmi cable and level with it", "overall": 4.0, "summary": "videosecu articulating wall mount", "unixReviewTime": 1324598400, "reviewTime": "12 23, 2011"}
{"reviewerID": "A3IC6OB22INS9", "asin": "0972683275", "reviewerName": "C. Johansen", "helpful": [0, 0], "reviewText": "Just to know that the TV will sit off center of where the base is placed. Other than that it has held up and worked.", "overall": 4.0, "summary": "product worked as advertised.", "unixReviewTime": 1369353600, "reviewTime": "05 24, 2013"}
{"reviewerID": "A3ISZ8KLXYYI7P", "asin": "0972683275", "reviewerName": "C. Lackey \"Great Product\"", "helpful": [0, 0], "reviewText": "This is the best mount I have ever found, especially for the price.Home Depot has a nearly identical mount for $90.This mount comes with every fastener you could need from Lags, Hollow Wall Anchors, Spacers, to varying lengths of Metric Fasteners to most if not all TVs.They mount easy and are sturdy; I have a 60&#34; LED TV on one without issue.I also have 32&#34;, 42&#34;, 46&#34;, and 50&#34; TVs on them; I have used these to mount every LED/LCD TV I or friends have mounted.", "overall": 5.0, "summary": "Best Mount Ever", "unixReviewTime": 1390348800, "reviewTime": "01 22, 2014"}
{"reviewerID": "A3QH8VQDE7HZCR", "asin": "0972683275", "reviewerName": "costaricachris", "helpful": [15, 19], "reviewText": "Quality was excellent. Instructions were clear. It was not clear about a tilt feature, but there was enough to level it when I finished. Be careful to get the wall bracket real vertical. (I was using it for a 23 inch computer screen so I really need it to be level for reading.) Everything I needed plus lots of extra hardware for different situations.", "overall": 5.0, "summary": "Real value for the money", "unixReviewTime": 1286236800, "reviewTime": "10 5, 2010"}
{"reviewerID": "A6J8D9V5S9MBE", "asin": "0972683275", "reviewerName": "Curtis G", "helpful": [0, 0], "reviewText": "In the process of turning our master bedroom into a fortress of solitude for my wife, we decided to mount ourPanasonic TC-L32X2 32-Inch 720p LCD HDTVon the wall, above the dresser, to save some space. (You can never have enough dresser space for displaying tchotchkes, amirite, fellas?) My wife wanted a fixed wall mount but I thought the viewing angle required some articulation. (In hindsight, fixed would have worked, too.) This unit was highly rated and the price was right. Sold.The installation was straightforward and fairly simple. The only point at which I needed some help was in balancing the TV while I attached it to the arm; otherwise it was all me. I think it looks great; my wife says it reminds her of being in the hospital. (Sorry, Honey.) When we mount thePanasonic VIERA TC-P42S30 42-Inch 1080p Plasma HDTVin the living room, I'll definitely use a flat mount.You could spend four times this much on an articulating TV mount, but I don't see why you would.", "overall": 5.0, "summary": "Simple and effective. Just the way I like it.", "unixReviewTime": 1306886400, "reviewTime": "06 1, 2011"}
{"reviewerID": "A39Z4OU2C7ENWH", "asin": "0972683275", "reviewerName": "Dave C", "helpful": [1, 1], "reviewText": "I gave this mount 3 stars.5 to start because out of the box, and mounted on the wall, I really liked it for my daughter's room. The ability to move her 26\" TV around so she can play in other areas of the room is a welcomed addition.I subtracted 1 star because of the tacky instructions and poor cable management for something that moves at maximum, about 2 feet away from the wall.1 more star fell off because now that the TV is mounted, the mount seems to sag, even though there are two huge lag bolts in a stud mounting it. That parts not the problem, the problem is where the tv mounts to the plate itself, it seems no matter how many washers you use, it just does not make full contact. Also if you move the TV to a new position the mounts seems to want to \"fall\" in that direction on its hinges. SO it must be releveled by yanking on it every time it moves.Otherwise, it works I guess. But for $50 I'd rather have a stationary mount that I never have to worry about. I would not set a tv larger than a 30\" or so on this. I just don't trust it.", "overall": 3.0, "summary": "Works, but I don't trust it", "unixReviewTime": 1328572800, "reviewTime": "02 7, 2012"}
{"reviewerID": "A2E5IK9TUH8UPD", "asin": "0972683275", "reviewerName": "David", "helpful": [0, 0], "reviewText": "For the price, this wall mount is great.  Not too hard to install.  The only reason I didn't give it a 5 star is wire management.  I could not get the little loop to work.  Not a big deal at all however.  Overall, I highly recommend this product.  Well worth the money.", "overall": 4.0, "summary": "Easy to install.  Wire managment is not the best.", "unixReviewTime": 1331078400, "reviewTime": "03 7, 2012"}
{"reviewerID": "AEQR0VUFBZXUY", "asin": "0972683275", "reviewerName": "D. Durbin \"Student of Poetry, Student of Life\"", "helpful": [0, 0], "reviewText": "Needed a corner mounted Flatscreen. This did the job well, easy to install. I had to mount in a metal stud, so I used two support boards in the back to distribute the weight more evenly. Expectations of item met at a fraction of the cost from competitors.", "overall": 5.0, "summary": "Good corner mount", "unixReviewTime": 1363737600, "reviewTime": "03 20, 2013"}
{"reviewerID": "A13BWQDECDDVIZ", "asin": "0972683275", "reviewerName": "D. Jacobs", "helpful": [0, 0], "reviewText": "I'd never bought one of these, mainly due to the high prices in the retail stores.  I hadn't looked online much, and hadn't really needed a monitor mounting device until recently.This thing is well built, and it does the job.  It's not fancy but if you are just looking for an inexpensive way to hang a monitor (TV or PC) on the wall this will do the job.  It comes with a nice bag of heavy-duty hardware.  It is primarily designed for mounting TV sets, but you can get it to work with a PC monitor, as long as it has the VESA mounting.It mainly articulates side-to-side and in-and-out.  It'll pivot a bit up and down, but that's limited.", "overall": 4.0, "summary": "VideoSecu", "unixReviewTime": 1296950400, "reviewTime": "02 6, 2011"}
{"reviewerID": "A12XCRHPREC51Y", "asin": "0972683275", "reviewerName": "DnP", "helpful": [0, 0], "reviewText": "Only gave this four stars because it's only supporting a 32&#34; TV. I think I would be scared to mount a 55&#34; TV on it. If you sprang for a 50&#34; or bigger TV, spend a little more on a properly rated mount. As with any TV mount, make sure you're hitting wall studs with the main screws, don't just use anchors in drywall or you're asking for trouble. LOTS of hardware included in the kit, so mounting any style or brand of TV shouldn't be a problem.", "overall": 4.0, "summary": "Nice mount for the money.", "unixReviewTime": 1371427200, "reviewTime": "06 17, 2013"}
{"reviewerID": "A3QPJS71FU70MX", "asin": "0972683275", "reviewerName": "Donald Jones", "helpful": [0, 0], "reviewText": "Nothing fancy, just decent quality and simple installation.  As may have been mentioned, one must discard the provided Phillips screws that the manufacturer provides to affix the bracket to the wall stud.  Use your own.  The TV I mounted with it is an older flat-panel, so it's a little heavier than the news ones.  This thing isn't fazed, and stays where I put it.", "overall": 4.0, "summary": "These mounts are amazing", "unixReviewTime": 1380240000, "reviewTime": "09 27, 2013"}
{"reviewerID": "A2A3B0JX2JRS6S", "asin": "0972683275", "reviewerName": "Dustan Dennington", "helpful": [0, 0], "reviewText": "Amazing how easy it is to move my 46&#34; around on this mount and able to hang off one stud. Nice quality feel to metal it is made of.", "overall": 5.0, "summary": "in love with this mount", "unixReviewTime": 1379462400, "reviewTime": "09 18, 2013"}
{"reviewerID": "A1ZPEZMQBCTZQN", "asin": "0972683275", "reviewerName": "Dusty", "helpful": [0, 0], "reviewText": "Very sturdy. The arm is very stiff at first so you have to work it lose.  However, the mount works great, just make sure you get that stud just right. I was impressed with the quality and happy with the price.", "overall": 4.0, "summary": "Works great.", "unixReviewTime": 1384300800, "reviewTime": "11 13, 2013"}
{"reviewerID": "A2OGXHE7PVLTOE", "asin": "0972683275", "reviewerName": "D. Wallas", "helpful": [0, 0], "reviewText": "Don't have anything to really complain about.  EXCEPT there doesn't seem to be a way, or i'm missing it to tilt the TV up or down (ie. mounted high on the wall and pointed down towards the chair).  and i am quite savvy with tools/assembly/etc. And it is difficult to get to the bolt heads on the back of the TV to adjust the angle.  No reason to not buy it though.", "overall": 4.0, "summary": "no problems with it.  works as intended.", "unixReviewTime": 1324080000, "reviewTime": "12 17, 2011"}
{"reviewerID": "A3OYE7X2O08LNT", "asin": "0972683275", "reviewerName": "dwilly910", "helpful": [0, 0], "reviewText": "Bought the mount for my 30&#34; Dell U3011 monitor.  It fits the Dell quite well, and I bought it for it's reach from the wall, it's ability to manipulate, and it's weight capacity.  And in all those respects, I'm quite happy.However, there is a noticeable tilt/sag to the monitor when I have the arm extended.  I'm not so concerned with sag perpendicular to the wall, as that was expected, but the rotational sag that I sometimes get.", "overall": 4.0, "summary": "Works good, but has some sag", "unixReviewTime": 1360195200, "reviewTime": "02 7, 2013"}
{"reviewerID": "A2LR9WP2JGDT8E", "asin": "0972683275", "reviewerName": "E. Coronel", "helpful": [0, 2], "reviewText": "The mount plate and the extender arms need to be screwed together and there are two holes for each arm to attach to the corner of the plate. The holes don't align so I couldn't put two screws in. I just used one screw which is not the most secure attachment. Then I used zip ties to secure the arm better. I did this because I had to install the tv ASAP and could not wait for a replacement. Also, the mounting bracket that attaches to the wall has a larger screw hole on the bottom. This means that the bottom can wiggle and the bracket will be misaligned. Again, I did a quick fix. I gave this 2 stars and not 1 because it actually stayed up on the wall and is now holding my tv, albeit due to my own ingenuity and not the quality of the mount. I should not have to do quick fixes on a product like this.", "overall": 2.0, "summary": "screw holes don't align", "unixReviewTime": 1355702400, "reviewTime": "12 17, 2012"}
{"reviewerID": "A18FTRFQQ141CP", "asin": "0972683275", "reviewerName": "ela92", "helpful": [0, 0], "reviewText": "VERY HAPPY, it looks great, I'm so happy we got it. Holds good, it is a lil hard to get it to the wall. Other then that its fine I love how we have more room in our room. My husband is so happy I ordered this, it only cost us $28 free shipping and FAST(: VERY THANKFUL TO THE SELLER.", "overall": 5.0, "summary": "SAMSUNG 32in PLASMA(: DOES THE WORK FOR US ( FAST SHIPPING!!!!!!!!)", "unixReviewTime": 1332028800, "reviewTime": "03 18, 2012"}
{"reviewerID": "A1XEYWWDJ09OEA", "asin": "0972683275", "reviewerName": "Eric Fleckenstein", "helpful": [0, 0], "reviewText": "I wasn't willing to pay $100 for simply mounting a TV, so I bought this item to give it a shot. I have no real complaints.  It holds the TV up, which is all I wanted.  It does not have smooth pivot points, so if you're planning on moving it around a lot, don't use this one, but if it's going to stay in a static area, this is your mount.", "overall": 4.0, "summary": "Great mount for the price", "unixReviewTime": 1297468800, "reviewTime": "02 12, 2011"}
{"reviewerID": "A2JMN2JA9LSHVL", "asin": "0972683275", "reviewerName": "Eric G. Gruner", "helpful": [1, 2], "reviewText": "Bought NEW but I could tell right away that mine had been repackaged and refurbished.  Plus the was missing the 4 arms but had some other random hardware included.  I made mine work for my 32&#34; set and it serves it's purpose. Just wish the seller was upfront on the condition, I could have bought a used one for $5 less.", "overall": 1.0, "summary": "Bought NEW Stand for $25, but mine had the 4 arms missing and was refurbished", "unixReviewTime": 1354320000, "reviewTime": "12 1, 2012"}
{"reviewerID": "A3ATF868IEP191", "asin": "0972683275", "reviewerName": "Eric", "helpful": [0, 0], "reviewText": "This is a rather good tv mount. This tv mount works exactly as expected and described. I would buy again.", "overall": 4.0, "summary": "good mount", "unixReviewTime": 1360540800, "reviewTime": "02 11, 2013"}
{"reviewerID": "A14O9P3DV5EHKO", "asin": "0972683275", "reviewerName": "E. Solch", "helpful": [0, 1], "reviewText": "I had to use a hacksaw to cut away part of this to hang my 24&#34; LED TV in my bedroom. Other than that, seems to work fine.", "overall": 3.0, "summary": "A little big for 24&#34; TV's", "unixReviewTime": 1359331200, "reviewTime": "01 28, 2013"}
{"reviewerID": "AVHB9LLVCTEKY", "asin": "0972683275", "reviewerName": "Evan Caltrider", "helpful": [0, 0], "reviewText": "I have a 42&#34; Hannspree LCD TV. It weighs 42.5 lbs. Most other reviews said they had a TV smaller than this so I was a little skeptical but got it because of the good price and it said it could hold 60 or so lbs. Most of my reservation was because it was the first time I've mounted a TV and worried it would fall within a week. I've had it over a month and its nice to have it be able to swing out, extend, and angle. I like the fact that I can get a bigger TV and still use this mount as its in my living room. It was not too hard to install. I bought a stud finder because I didn't have one and most everything else I already had to install it. I do highly recommend recruiting some help with the install, at least for when putting the TV on. This would be extremely hard by yourself, especially if you have a bigger TV. Overall, very happy with this mount.", "overall": 5.0, "summary": "Good and versatile", "unixReviewTime": 1375142400, "reviewTime": "07 30, 2013"}
{"reviewerID": "A2GPNXFUUV51ZZ", "asin": "0972683275", "reviewerName": "Farmer-Al", "helpful": [0, 0], "reviewText": "Installed easy and in no time at all (finding the stud was the hardest part for me).  Articulates well with the 40&#34; TV on it. I would not hesitate to look for this brand when it is time for the next TV mount.", "overall": 5.0, "summary": "Easy install, great price, good performance.", "unixReviewTime": 1395878400, "reviewTime": "03 27, 2014"}
{"reviewerID": "A3CLWR1UUZT6TG", "asin": "0972683275", "reviewerName": "FD Firefighter 121 \"Remember the 343\"", "helpful": [0, 0], "reviewText": "I have two of these now in different rooms. Works well with my Samsung TV'S  for the size noted above", "overall": 5.0, "summary": "Works well", "unixReviewTime": 1373587200, "reviewTime": "07 12, 2013"}
{"reviewerID": "A1V8UZ63FQD382", "asin": "0972683275", "reviewerName": "FL Guy \"FL Guy\"", "helpful": [0, 0], "reviewText": "We got this one recently and its a great wall mount. The unit is pretty heavy, so you will need a helper. It also includes a variety of screws to mount also. Our TV documentation stated it was a 400x400 pattern. But after putting hte plate over the back, seems we didn't need the extra extenders as its 200x200. This is on a Samsung 40&#34; 5000 series LEDTV.The arm is hard to push and pull, but that is more due to being new and stiff. Make sure you adjust the tilt angle screws as our unit came with them loose so we had to tighten them.I initially was scared to mount it (what if it falls if I screw up!!!) but its pretty easy. Not only did i use a stud finder to get the general location of the stud, but i also used nails to get the actual edges (those basic studfinders are never &#34;exact&#34;). make sure you do the same.not bad for $30-ish", "overall": 5.0, "summary": "Great product", "unixReviewTime": 1376870400, "reviewTime": "08 19, 2013"}
{"reviewerID": "A3Q7DHKIU7TMBI", "asin": "0972683275", "reviewerName": "follownobody", "helpful": [0, 0], "reviewText": "this is a good product.  It went up easily.  I did it myself.  I wish I might have gotten one with a little more adjustment.  It's very rigid.", "overall": 4.0, "summary": "for my office tv", "unixReviewTime": 1357171200, "reviewTime": "01 3, 2013"}
{"reviewerID": "AOOQGCJEV25VT", "asin": "0972683275", "reviewerName": "Frankie", "helpful": [0, 0], "reviewText": "I have purchased 3 of these wall mounts and they hold my 37 and 32 inch flat screens perfectly. I love these and highly recommend them.", "overall": 5.0, "summary": "One of the best wal mount sets ever!!", "unixReviewTime": 1355184000, "reviewTime": "12 11, 2012"}
{"reviewerID": "A24OHQK700QEIW", "asin": "0972683275", "reviewerName": "Fredy", "helpful": [0, 0], "reviewText": "Very good item; I am happy wit it, and delivery time was excellent!!  I recomended; is a good support for your LED TV. It is easy to install, and it have extra screws for different sizes TV.", "overall": 5.0, "summary": "Very good!!", "unixReviewTime": 1335916800, "reviewTime": "05 2, 2012"}
{"reviewerID": "A3T3M5EYGCWSUA", "asin": "0972683275", "reviewerName": "Frequent Amazon Customer", "helpful": [0, 0], "reviewText": "This was perfect for my 24\" LED monitor, I had it up in just a few mins and with no problems.  It included a small bubble level and it also came with a 6' HDMI cable which I was not expecting.", "overall": 5.0, "summary": "Strong/Easy install/ and comes with HDMI cable also!", "unixReviewTime": 1309564800, "reviewTime": "07 2, 2011"}
{"reviewerID": "A38FGQVJM18OWV", "asin": "0972683275", "reviewerName": "George S. Mitchell \"gsmitchell\"", "helpful": [8, 18], "reviewText": "I checked around Amazon as well as some other sites, and decided these were what I needed.  I read the reviews, looked at the pictures and bought two of these.  I received them today.  I unpacked one of them, read the instructions and immediately filled out the return request for Amazon.  These mounts are very, very heavy and require 6, yes SIX, screws to mount to the wall.  Are you kidding me?  The TVs are only 22 lbs!  Two screws in the studs and then more damage to the wall than is necessary.  What a joke!  And Lag bolts?  Ever heard of screws?  The other issue is that these are very hard to move.  I bought an articulating wall mount for a reason, and I expect them to be able to move without a wrench in my hand.", "overall": 1.0, "summary": "What a piece of junk!", "unixReviewTime": 1291161600, "reviewTime": "12 1, 2010"}
{"reviewerID": "A1CA40102FA5N0", "asin": "0972683275", "reviewerName": "Gerald Wendel", "helpful": [0, 0], "reviewText": "Installed easily, has a nice long reach.  Attached a 32&#34; TV for the grandkids and it works out great. accomodates many different size TV's and was a very good price.", "overall": 5.0, "summary": "Nice reach", "unixReviewTime": 1395446400, "reviewTime": "03 22, 2014"}
{"reviewerID": "A12PFARGH9ELDI", "asin": "0972683275", "reviewerName": "G. Kelly", "helpful": [0, 0], "reviewText": "For the price.....can't be beat.  I have two TV's hanging in the living room.  No issues, easy to hang.  I would recommend to a friend.", "overall": 5.0, "summary": "For the price, can't be beat.", "unixReviewTime": 1377734400, "reviewTime": "08 29, 2013"}
{"reviewerID": "A1P560UNX4SBE7", "asin": "0972683275", "reviewerName": "goatbear2", "helpful": [2, 2], "reviewText": "Works Great. Holds my 40 inch TV effortlessly. Very well built. Definitely worth the price. Easy to install TV to the mount. Has cord clips. TV can be tilted up or down and sideways. Extends from the wall 24 inches. I highly recommend this brand..", "overall": 5.0, "summary": "Samsung TV wall Mount", "unixReviewTime": 1382400000, "reviewTime": "10 22, 2013"}
{"reviewerID": "A28RVT20CEXA8B", "asin": "0972683275", "reviewerName": "Golfore", "helpful": [0, 0], "reviewText": "Used this with a Panasonic 22 inch LCD. Very durable and works as advertised.It was advertised as fitting 22\"-37\" televisions, but the size of the t.v mounting plate is so large that it covers some of the plug connections on the back of the television. I will have to cut the metal plate to get to the P.C connector if i choose to connect a computer.Haven't decided if i will keep or send back to get something with a smaller mounting plate.Other than that, it's a great product and meets my need for a hanging television.", "overall": 4.0, "summary": "Durable", "unixReviewTime": 1295654400, "reviewTime": "01 22, 2011"}
{"reviewerID": "A27OMVFGJXH1VB", "asin": "0972683275", "reviewerName": "Goneanddidit", "helpful": [0, 0], "reviewText": "I have a 47&#34; TV and had no place to put it in my bed room. With this mount it use the space i had a poster hanging. Very easy to install, came with all hard ware.", "overall": 5.0, "summary": "Got Room?", "unixReviewTime": 1360886400, "reviewTime": "02 15, 2013"}
{"reviewerID": "A3E4YU6APQLRKE", "asin": "0972683275", "reviewerName": "Green_Steve", "helpful": [0, 0], "reviewText": "Great Mount, so many areas of articulation. This was a great gift idea my mother loves it. I have purchased two of them and they are sturdy and give a touch of class to every room you put them in. A must have any video file or those who want to save space in a bedroom or office.", "overall": 5.0, "summary": "One more elegant solution for the home or office.", "unixReviewTime": 1384646400, "reviewTime": "11 17, 2013"}
{"reviewerID": "A1N4DKWTQ9YP1Q", "asin": "0972683275", "reviewerName": "Heidi L. Rathbone \"HLR61\"", "helpful": [0, 0], "reviewText": "This is perfect for what I needed it for. I can move the screen from side to side if I need to and I don't have the TV sitting on my desk.....", "overall": 5.0, "summary": "Wall Mount", "unixReviewTime": 1359763200, "reviewTime": "02 2, 2013"}
{"reviewerID": "AD0VA39FRVNKN", "asin": "0972683275", "reviewerName": "HM", "helpful": [0, 1], "reviewText": "have not had the opportunity to install the tv mount as of yet - will follow up once mounted in place. great price and quick shipping", "overall": 5.0, "summary": "Vide Swing Arm tv mount", "unixReviewTime": 1360627200, "reviewTime": "02 12, 2013"}
{"reviewerID": "ABM9CL72EGWKN", "asin": "0972683275", "reviewerName": "Hold Fast", "helpful": [0, 0], "reviewText": "Why pay the $$$$ at Best Buy when you can get the same products for a fraction of the prices here.  The VideoSecu Long Arm TV Wall Mount Low Profile Full Motion works great.", "overall": 4.0, "summary": "Good Product", "unixReviewTime": 1383782400, "reviewTime": "11 7, 2013"}
{"reviewerID": "A3A7ZJ4QS65X15", "asin": "0972683275", "reviewerName": "Isaac LePes", "helpful": [0, 0], "reviewText": "Pro's: Easy to setup.  Supports many different VESA formats. Has some articulation.  Sturdy construction.  Can be installed by one person w/o too much effort.Con's: Cable guides fall off easily.  The joints are a bit too stiff; you really have to man-handle it to get it fully extended, and you have to push fairly hard to get it to compact again.  So far I have not noticed any wear from this firm pulling/pushing, but I worry because it is only attached to the studs buy 2 bolts.", "overall": 3.0, "summary": "Bought to mount 46\" LCD", "unixReviewTime": 1360281600, "reviewTime": "02 8, 2013"}
{"reviewerID": "A110S8IJ3ZID0D", "asin": "0972683275", "reviewerName": "Jake", "helpful": [0, 0], "reviewText": "We bought this for a 55&#34; Vizio and it worked perfectly. I would buy it again and recommend it. Good quality.", "overall": 5.0, "summary": "Worked great for 55\" Vizio", "unixReviewTime": 1388620800, "reviewTime": "01 2, 2014"}
{"reviewerID": "A11NR4AJK9TNQM", "asin": "0972683275", "reviewerName": "jaldeborgh \"jaldeborgh\"", "helpful": [0, 0], "reviewText": "I am impressed with the solid design of this TV Wall Mount.  I think this weights more than the 26\" TV it is supporting.  It also has lots of logical adjustments so leveling the TV isn't too difficult.  The one semi negative is that it takes a fair amount of force to reposition the TV.  This does assure the TV stays put but if you plan to move the TV on the stand a lot this may be a negative.  Overall I am pleased with the stand - it seems like a good value.", "overall": 4.0, "summary": "Solid Design - Adjustable", "unixReviewTime": 1311552000, "reviewTime": "07 25, 2011"}
{"reviewerID": "A13M65IGNEQXW1", "asin": "0972683275", "reviewerName": "James", "helpful": [0, 0], "reviewText": "I bought the uint for a 32 &#34; Tando.  I couldn't get the parts to line up so I bought another fixed type.", "overall": 3.0, "summary": "Didn't fit as I expected", "unixReviewTime": 1359158400, "reviewTime": "01 26, 2013"}
{"reviewerID": "A180BZHVJIRWBZ", "asin": "0972683275", "reviewerName": "James Mac", "helpful": [0, 0], "reviewText": "Very well made, strong mount the only problem I have is the instructions are very poorly written or detailed. Pictures do not distinguish between Stud mount and concrete. Also the instructions do not tell you the size of the included boltsFor those of you who have never worked in the home building industry wall studs are usually 1.5 inches wide so this mount only requires 2 lag bolts in the middle holes to secure it to the wall to support a 23 lb TV. The four outboard holes on the wall mount are 1.3\" apart so don't try to use them in a wall stud measuring 1.5\" wide.Helpful hint: I have help install at least 6 other wall mounts because of family or friends so I cannot say that I am an expert but my suggestion is to drill pilot holes which the instructions do not tell you to do.After comparing the instructions on this unit to others I have installed I still must say that the pictures should have a lot more detail. Some complain that the back plate was too big for the TV they used but it's fits perfect on theLG 32LK450 32-Inch 1080p 60Hz LCD HDTVI am using it on.Works perfectly for the area of the room I am using it in which allows me to rearrange the room without the need to move the TV.", "overall": 4.0, "summary": "Very well made, strong mount.", "unixReviewTime": 1319241600, "reviewTime": "10 22, 2011"}
{"reviewerID": "A1R2514DVWIIMV", "asin": "0972683275", "reviewerName": "Jamie Richardson", "helpful": [1, 1], "reviewText": "Perhaps I misunderstood how to install the mount, but I:1) Installed the mount to the wall (easy enough)2) Attach TV the mount with some screws (difficult for one person)With one arm I held the TV (heavy!). The other arm was trying to attach some small screws connecting the TV to the mount. It took quite an effort to hold the TV for that long. Certainly having two people installing this would be waaaay easier :-)I have another similar mount where the TV back plate and the mount are separate parts. So once the back plate is installed, you slide the connecting parts together. Much easier! :-)", "overall": 4.0, "summary": "Solid, but not the best mount I've had", "unixReviewTime": 1293408000, "reviewTime": "12 27, 2010"}
{"reviewerID": "A1KM3IPZ9H0JKZ", "asin": "0972683275", "reviewerName": "J. A. Quayle", "helpful": [0, 0], "reviewText": "It took about 10 mins to install this TV Wall Mount with a 48 inch Samsung TV.  It does the job, there are much more expensive arms, but this does the trick.", "overall": 4.0, "summary": "Easy to install, cheap, easy to use", "unixReviewTime": 1390867200, "reviewTime": "01 28, 2014"}
{"reviewerID": "AZ6SUJ5T0KBE5", "asin": "0972683275", "reviewerName": "Jason", "helpful": [0, 1], "reviewText": "I used this to hang my 40&#34; LCD that I bought back in 07, so it's a heavy TV that outweighs my new 50&#34;.  Everything seems to be made well, it was easy to install myself, and the TV has been hanging for 2 months now from a brick wall at it's full reach.  I can't imagine paying $100 for other TV wall mounts, as well as this one performs.", "overall": 5.0, "summary": "Great bargain!", "unixReviewTime": 1374451200, "reviewTime": "07 22, 2013"}
